<a href="https://colab.research.google.com/github/TerrenceM12/AAI2025/blob/main/BUS4_118S_Pandas_Lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
from sqlalchemy import create_engine  # Only for database example

# ---- 1. Load data from CSV ----
csv_data = pd.read_csv('sample_data.csv')
print(" CSV Data Loaded:")
print(csv_data.head())

# ---- 2. Load data from Excel ----
excel_data = pd.read_excel('sample_data.xlsx', engine='openpyxl')
print("\n Excel Data Loaded:")
print(excel_data.head())

# ---- 3. Load data from a SQL database (Optional demo) ----
# Example using SQLite for demonstration
# Create a connection (replace with your DB URI)
# engine = create_engine('sqlite:///example.db')  # Assumes example.db exists
# sql_data = pd.read_sql('SELECT * FROM your_table', engine)
# print("\n SQL Data Loaded:")
# print(sql_data.head())

# ---- Basic Data Exploration ----
print("\n First 5 Rows:")
print(csv_data.head())

print("\n Last 5 Rows:")
print(csv_data.tail())

print("\n Info:")
csv_data.info()

print("\n Summary Statistics:")
print(csv_data.describe())

 CSV Data Loaded:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000

 Excel Data Loaded:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000

 First 5 Rows:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000

 Last 5 Rows:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000

 Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

 Summary Statistics:
             Age        Salary
count   5.000000      5.000000
mean   26.800000  75000.000000
std     3.962323  11180.339887
min    22.000000  60000.000000
25%    24.000000  70000.000000
50%    27.000000  75000.000000
75%    29.000000  80000.000000
max    32.000000  90000.000000

# New Section

In [5]:
import pandas as pd

# Create a sample DataFrame (reusing the data from sample_data.csv)
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 60000, 90000, 75000]
}
df_excel = pd.DataFrame(data)

# Save the DataFrame to an Excel file
df_excel.to_excel('sample_data.xlsx', index=False)
print("sample_data.xlsx created successfully:")
print(df_excel.head())

sample_data.xlsx created successfully:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000

In [2]:
import pandas as pd
import numpy as np

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 60000, 90000, 75000]
}
df = pd.DataFrame(data)

# Save the DataFrame to a CSV file
df.to_csv('sample_data.csv', index=False)
print("sample_data.csv created successfully:")
print(df.head())

sample_data.csv created successfully:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000
4      Eve   29      Phoenix   75000